app/Http/Controllers/CategoryController.php

    public function index()
    {
        if (Gate::denies('adminAccess', auth()->user())) {
            return response()->json(['message' => 'Accesso negato'], 403);
        }

        return response()->json(Category::all(), 200);
---
select * from `categories`