app/Http/Controllers/EpisodeController.php

select * from `episodes`
---
    public function index()
    {
        $user = Auth::user();

        if ($user->role === 'Admin') {
            return response()->json(Episode::all(), 200);