app/Http/Controllers/MovieController.php

select * from `movies`
---
    public function index()
    {
        $user = Auth::user();

        if ($user->role === 'Admin') {
            return response()->json(Movie::all(), 200);