app/Http/Controllers/SerieTvController.php

select * from `serie_tv`
---
    public function index()
    {
        $user = Auth::user();

        if ($user->role === 'Admin') {
            return response()->json(SerieTv::all());