app/Http/Controllers/UserController.php

select * from `users`
---
    public function index()
    {
        $this->authorize('adminAccess', User::class);
        return response()->json(User::all(), 200);